[
    {
        "name": "Snehal Prakash",
        "time": "1 year ago",
        "source": "Google",
        "rating": 5,
        "text": "A big thanks to Anusha and her team for helping me for acquiring my Schengen Visa.! They really helped me in collecting and preparing all the required documents for the visa application. The complete team was very professional and did an exceptional job!  I got my Visa in just 3 Days! Kudos to Anusha and team Global Visa International.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXGeZmRzZDOw452Ssj6N5L3xCnZZq3T_YMahdShdtR3rdLfJ2be_Q=w32-h32-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/mL2DJEAWFAiazQgN6",
        "reply": "Dear Snehal, Congratulations on your Schengen Visa Grant! We are so happy that we could stand on your expectations. Thank you so much for your wonderful review. Please stay in touch and always happy to serve you. Bon Voyage!! Regards, Team Global Visa Internationals"
    },
    {
        "name": "Rachita M",
        "time": "13 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Dear Anusha and Team,  I want to express my deepest gratitude for the incredible support and guidance you provided throughout our immigration journey to Australia.    This process came with its fair share of challenges — especially during the uncertainty of the COVID pandemic. With border closures, extended time lines, and the need to revisit paperwork multiple time's, it often felt overwhelming. But your unwavering support, patience, and professionalism helped us navigate every step with confidence and hope.    Through all the ups and downs, your team remained a constant source of reassurance. You didn’t just help with paperwork and procedures — you stood by us, encouraged us, and ultimately made our dream come true.    Thank you for being such a vital part of this life-changing journey. We will always be grateful.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKyuUt0BhIMQZ5xnQFq4TewIAP8uYkZ1G40O40odDFLYgMnowI=w65-h65-p-rp-mo-ba3-br100",
        "link": "https://share.google/1nKBIcjDyv2uz5G2J"
    },
    {
        "name": "Shruthi AE",
        "time": "4 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Thank you global visa ,your services are awesome,I obtained visa hassle free because of your services.I would recommend everyone Global visa any time.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLD0bGpUVfhkIZJMmazJCVCGeYwUrd0WvK4ug7jIXWZQNmVDw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/l6rtyeBnYAkKufHRg"
    },
    {
        "name": "Uren shah",
        "time": "2 months ago",
        "source": "Google",
        "rating": 5,
        "text": "After facing two refusals for my parents’ UK visitor visa, we were extremely disheartened and unsure of what to do next. That’s when we approached Global Visa International, and it made all the difference.\n\nA special thanks to Vidhya who handled our case with great care, patience, and professionalism. She understood our situation, guided us step by step, and helped us submit a much stronger application.\n\nThanks to her support and the team’s expertise, my parents have finally received their visa! We’re truly grateful and highly recommend Global Visa International to anyone needing visa assistance.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocI-1Lm_rD0wDNAG9M_ZxRYaaMyVjV8p8FdAFTJ2a1c8zUq4uQ=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/wEctJtfYgGZreGWvC"
    }
]