[
    {
        "name": "ZiYa SaYeD",
        "time": "2 days ago",
        "source": "Google",
        "rating": 5,
        "text": "I would like to extend my sincere thanks to the entire Global Visa International team for their exceptional support and guidance throughout the visa process. Your professionalism and efficient service are truly appreciated.I highly recommend your services to anyone seeking a hassle-free and well-managed visa process. Thank you for your outstanding work👍. All the best for your future services and continued success .",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLTs21FTncSi2QIGONdeA28d7eOMmIVpwynqC-N5iE1vKGFtw=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/JywNmTxyDxSEKjAAA",
        "reply": ""
    },
    {
        "name": "Deena Purushothaman",
        "time": "2 weeks ago",
        "source": "Google",
        "rating": 5,
        "text": "I've had 3 successfull visas done by them so far, and I Got my latest UK visa approved within a few days of submitting. My documents were prepared and uploaded perfectly. They have a great team and patiently handled all my queries. I was hand held throughout the entire process and even though we had to submit more than 50 documents, the process did not feel hard because they guided me through everything.\n\n I'm more than happy to use them for any other visa in the future. Anusha and her full team and (Vidya, my consultant) were very cooperative.\n\nI had the smoothest experience and would recommend their services in the blink of an eye.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVgqBrNBHRZWUGjxgaphpcJQb08Kqd4wzjQcf7K4EjWuq4UuoLz=w36-h36-p-rp-mo-ba6-br100",
        "link": "https://maps.app.goo.gl/UbvRPQQr7Lruyqez6",
        "reply": ""
    },
    {
        "name": "Deena P",
        "time": "2 weeks ago",
        "source": "Google",
        "rating": 5,
        "text": "Visa experts and absolute professionals. Handled my UK visa without a glitch, and I got my visa approved within few days of applying. I will always be using them for any visa processing in the future. Anusha and the complete team are just excellent!",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLDMWdJW3vF-KXR57_cm7LkV_N4bGoYHc-je6o-snmI2cKgig=w72-h72-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/kY2M9DC4Ci5iBfut7",
        "reply": ""
    },
    {
        "name": "Snehal Prakash",
        "time": "1 year ago",
        "source": "Google",
        "rating": 5,
        "text": "A big thanks to Anusha and her team for helping me for acquiring my Schengen Visa.! They really helped me in collecting and preparing all the required documents for the visa application. The complete team was very professional and did an exceptional job!  I got my Visa in just 3 Days! Kudos to Anusha and team Global Visa International.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXGeZmRzZDOw452Ssj6N5L3xCnZZq3T_YMahdShdtR3rdLfJ2be_Q=w32-h32-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/mL2DJEAWFAiazQgN6",
        "reply": "Dear Snehal, Congratulations on your Schengen Visa Grant! We are so happy that we could stand on your expectations. Thank you so much for your wonderful review. Please stay in touch and always happy to serve you. Bon Voyage!! Regards, Team Global Visa Internationals"
    },
    {
        "name": "Rachita M",
        "time": "13 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Dear Anusha and Team,  I want to express my deepest gratitude for the incredible support and guidance you provided throughout our immigration journey to Australia.    This process came with its fair share of challenges — especially during the uncertainty of the COVID pandemic. With border closures, extended time lines, and the need to revisit paperwork multiple time's, it often felt overwhelming. But your unwavering support, patience, and professionalism helped us navigate every step with confidence and hope.    Through all the ups and downs, your team remained a constant source of reassurance. You didn' t just help with paperwork and procedures — you stood by us, encouraged us, and ultimately made our dream come true.    Thank you for being such a vital part of this life-changing journey. We will always be grateful.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKyuUt0BhIMQZ5xnQFq4TewIAP8uYkZ1G40O40odDFLYgMnowI=w65-h65-p-rp-mo-ba3-br100",
        "link": "https://share.google/1nKBIcjDyv2uz5G2J"
    },
    {
        "name": "Shruthi AE",
        "time": "4 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Thank you global visa ,your services are awesome,I obtained visa hassle free because of your services.I would recommend everyone Global visa any time.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLD0bGpUVfhkIZJMmazJCVCGeYwUrd0WvK4ug7jIXWZQNmVDw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/l6rtyeBnYAkKufHRg"
    },
    {
        "name": "Uren shah",
        "time": "2 months ago",
        "source": "Google",
        "rating": 5,
        "text": "After facing two refusals for my parents'  UK visitor visa, we were extremely disheartened and unsure of what to do next. That' s when we approached Global Visa International, and it made all the difference.  \n\n  A special thanks to Vidhya who handled our case with great care, patience, and professionalism. She understood our situation, guided us step by step, and helped us submit a much stronger application.  \n\n  Thanks to her support and the team' s expertise, my parents have finally received their visa! We' re truly grateful and highly recommend Global Visa International to anyone needing visa assistance.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocI-1Lm_rD0wDNAG9M_ZxRYaaMyVjV8p8FdAFTJ2a1c8zUq4uQ=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/wEctJtfYgGZreGWvC"
    },
    {
        "name": "Arvind Radhakrishnan",
        "time": "1 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Excellent service by the team. Very professional. Thank you",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjW9BJAxrqNlz4X2tKAmQCh5l3HgASMMCv5aUKIZ-FbV_N1p80Y9=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/VzxTtkENFCLjxFoKE"
    },
    {
        "name": "Hitesh Shah",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Had a great experience working with the Global Visa team. Anusha as a leader is considerate and very helpful.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKZn-mcb_ZfrdQ21leQZZSIbAuYGA4RsvUJXyZw_moELMv88A=w65-h65-p-rp-mo-ba4-br1000",
        "link": "https://share.google/TtxLEw7CuMMPxyoJt"
    },
    {
        "name": "adarsh shah",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXJzKtC_mmIkIabWLfzSpHcaIU6GKSedGi2mRdLZtdzdgQcOdM=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/TtxLEw7CuMMPxyoJt",
        "reply": "Thank you so much, Adarsh, for your kind words and 5-star review! 🙏  \n\n  We are truly delighted to have helped you successfully secure your USA Student Visa. 🎓✈️ Your trust in Global Visa Internationals means a lot to us.  \n\n   Our team strives to make the visa process smooth and stress-free for every student. Wishing you all the best in your academic journey ahead! 🇺🇸📚  \n\n   If you need any further assistance — travel, documentation, or post-arrival support — we' re always here for you.  \n\n   Thanks again for choosing us as your visa consultants in Bangalore!"
    },
    {
        "name": "N K Reshma",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "I had an amazing experience with Anusha Prashanth. I had only a week before my travel date, and other agencies told me it was not possible to get a Schengen visa in such a short time. But Anusha was confident and assured me it could be done — and she delivered! I received my Spain visa in just 3 days, exactly as promised, and she also helped me with a priority UK visa.  \n\n   Special thanks to Vidya for ensuring all my documentation was perfect and the process was smooth from start to finish. Truly professional, reliable, and efficient. Highly recommend them for any visa needs!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjW4icfFk44_yDtXgCEoWgRMfTJStVm976TKyqwukmvAaNNh__wr=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/rFgnXk7i1jAzfDUrC"
    },
    {
        "name": "Bhavya Ammu",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Dear Global Visa Team,  \n\n  I would like to express my sincere thanks for your exceptional support in helping me secure my Australia visa within just a week. Your efficiency, professionalism, and prompt coordination made the process smooth and stress-free.  \n\n  A special note of appreciation to Anusha and Vidhya for their in-depth knowledge, transparency, and constant communication throughout the entire process. Your dedication truly stands out.  \n\n  This isn' t the first time I' ve had such a great experience with your team — last year, you also assisted me with my Europe visa, and I was equally impressed.  \n\n  I look forward to continuing our relationship for all my future travel needs. Thank you once again for being such a reliable and supportive partner.  \n\n  Regards  \n\n  Bhavya Praveen",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLXSHaRYswyFsk5hATQ6WWjlbiD3l92j_-53Dz071TO3tYWOw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/q5HPAkGIzgp3SKFIv"
    },
    {
        "name": "Mahesh Hiremath",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Okay super",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjV8lDR8J5RLnCmSDgaOh3LvTZXajbnQl1BY-GJezIAm4VM3scdCZg=w65-h65-p-rp-mo-ba3-br100",
        "link": "https://share.google/xBQaEwtAKnxcyYoko"
    },
    {
        "name": "Naina Teertha",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "I would like to thank Anusha and team for getting me the new zealand visitor visa. I got the visa within a month after submitting the application.Anusha is so friendly to talk. I insist can go for visa application at this place based on my personal experience. Thanks Anu for processing my application 💕💕.  \n\n  I thank the team again \n I know anu from long time \n This is my second time visa which I applied at her place  \n\n  And I m really happy that I received shengan visa within two weeks \n The team is very professional and they handle with care \n If you are looking for a germany and other 29 countries travel \n Then this is the place to visit to apply the visa \n They will take care of it end to end  \n\n  Thanks Vidya and Anu for the support.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKwesy-FWOg-w6dBza0Q7kDZILLtsIf218o-mIfyykK9nBP1A=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/z7MgZd23Dl2V4VCKg",
        "reply": "Thank you, Naina, for your kind. Once again, congratulations on the grant of your Schengen Visa (Five-Year Multiple Entry).  \n\n  We wish you all the very best.  \n\n  Team Global Visa Internationals"
    },
    {
        "name": "Rachita M",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Dear Anusha and Team,  \n\n  I want to express my deepest gratitude for the incredible support and guidance you provided throughout our immigration journey to Australia.  \n\n  This process came with its fair share of challenges — especially during the uncertainty of the COVID pandemic. With border closures, extended timelines, and the need to revisit paperwork multiple times, it often felt overwhelming. But your unwavering support, patience, and professionalism helped us navigate every step with confidence and hope.  \n\n  Through all the ups and downs, your team remained a constant source of reassurance. You didn' t just help with paperwork and procedures — you stood by us, encouraged us, and ultimately made our dream come true.  \n\n  Thank you for being such a vital part of this life-changing journey. We will always be grateful.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKyuUt0BhIMQZ5xnQFq4TewIAP8uYkZ1G40O40odDFLYgMnowI=w65-h65-p-rp-mo-ba3-br100",
        "link": "https://share.google/UlKIAeWXuqtyeIPXA",
        "reply": ""
    },
    {
        "name": "Karthik Prabhakaran",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "I got in touch with Global Visa to assist with my in-laws' tourist visa application for Switzerland, and I couldn't be happier with their service! From the very beginning, the team was extremely professional, knowledgeable, and supportive throughout the entire visa process. They patiently guided us through all the documentation requirements, ensuring everything was accurate and complete, which made the entire application process smooth and stress-free.  \n\n  What impressed me even more was their continued support even after the visa was approved. Due to some unforeseen changes in our travel plans, we needed to modify the travel insurance dates. The team handled this promptly and efficiently, ensuring everything was updated without any hassle.  \n\n  Their dedication, attention to detail, and excellent customer service truly made a difference. I highly recommend Global Visa to anyone looking for reliable and professional assistance for visa processing and travel-related support. Thank you for making this experience so easy and positive for our family!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjX3Rx99XP3zTzF3FT4OmxmHyst333exyoqXNwDX0CIDKDjuq0aa=w65-h65-p-rp-mo-ba2-br100",
        "link": "https://share.google/KgKgA7rr4Bm5FExSL",
        "reply": ""
    },
    {
        "name": "Shruthi AE",
        "time": "4 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Thank you global visa ,your services are awesome,I obtained visa hassle free because of your services.I would recommend everyone Global visa anytime.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLD0bGpUVfhkIZJMmazJCVCGeYwUrd0WvK4ug7jIXWZQNmVDw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/sXnAxwZ5USR6rsxEJ",
        "reply": ""
    },
    {
        "name": "Priya Srinivasa",
        "time": "4 months ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocJ-NCEHESpGyvq1P4wlKh3XYrnZKD4UsoLJlpQ8XwHfmSjTtQ=w65-h65-p-rp-mo-br100",
        "link": "",
        "reply": ""
    },
    {
        "name": "Santhosh Francis",
        "time": "6 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Big thanks to Global Visa Internationals Agency for turning a stressful visa process into a breeze! Their team was on point with every detail, and thanks to them, my Schengen visa came through without a hitch. Totally recommend them if you want peace of mind during the visa application and documentation process!",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLZcvHtcMRyHbh7R-y7KXfAR5xSPtaJ-KFoaA2ce6XunaBqYg=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/EBVtuE5MXjpI4qCJJ",
        "reply": "Thank you so much for your kind words and for trusting Global Visa Internationals with your Schengen visa process! 🌍✈️ We're thrilled to hear that we could make things smooth and stress-free for you. Your recommendation means a lot to our team. Wishing you amazing travels ahead – we're always here if you need any visa assistance in the future! 🙌😊"
    },
    {
        "name": "vimal khumar",
        "time": "6 months ago",
        "source": "Google",
        "rating": 5,
        "text": "I was referred to Global Visa Internationals in Bangalore by a friend who had a successful visa experience with them after a couple of initial rejections. From the very beginning, the team was approachable and clearly explained all the requirements—right from financial documentation to the necessary paperwork.  \n\n  Vidya, who handled my case, was extremely patient, always listened carefully, and sought second opinions from Anusha whenever there was a doubt. This gave me a lot of confidence throughout the process, especially since my family had faced a couple of visa rejections before.  \n\n  Vidya managed the entire process smoothly and took care of almost all the documentation, only asking me for a few mandatory documents. Thanks to the professionalism and support from the team, my family finally got their visa approved.  \n\n  A big thanks to Global Visa Internationals—and a special mention to Vidya for her dedication and support!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVsy-YMLUsxVOBIai316QBQWYDaYNsyXN8KikwN4O_4qoLprZLw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/kJdtXn50aWYk9eosG",
        "reply": "Thank you so much for taking the time to share your experience! We're truly delighted to hear that Vidya and Anusha were able to support you and your family through the visa process with care and professionalism. Helping clients overcome past rejections and succeed brings us immense satisfaction. We'll be sure to pass along your kind words to Vidya – she' ll be thrilled! 😊 Wishing you and your family all the best on your travels, and we' re always here if you need us again! ✨🌏"
    },
    {
        "name": "muhammed shazul",
        "time": "7 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Please do consider GLOBAL VISA INTERNATIONALS when thinking of getting a visa to US OR UK or anywhere around the world. Had a wonderfull experice with the team. Kudos to the GLOBAL VISA TEAM.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjUOjZUAkWEUpRkormcEHdrxorQO288IteNKGLHxJFlFocwzzDeK=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/5MHMA2T8e0vstY3gt",
        "reply": "Dear Shazul  \n\n  Congratulations on your USA Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards  \n\n  Team GVI"
    },
    {
        "name": "indu sethi",
        "time": "7 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Very good service. Thank you..",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLXzkRFWxg6o-iBv0BN4xeRdeFanAlX7e4YYfInhAoVvyL9bw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/exRjlZzWaB2HCKL8o",
        "reply": "Dear Indu  \n\n  Congratulations on your Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Venu Kammam",
        "time": "7 months ago",
        "source": "Google",
        "rating": 5,
        "text": "⭐⭐⭐⭐⭐ Excellent Service!  \n\n  I had a great experience with Global visa ( Anusha and Vidhya) for visa application. The team was professional, efficient, and very helpful throughout the entire process. They provided clear guidance, ensured all my documents were in order, and kept me updated at every step. Thanks to their expertise, visa was approved without any hassle. I highly recommend Global visa internationals to anyone looking for a smooth and stress-free visa application process!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXSAmM4th1RZ18V04m-hxCHkstxryuMVs7tKNdjgMKD4slA5ao=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/dc6DLCzYh3TYUwwJJ",
        "reply": "Dear Venu \n Congratulations on your USA Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Anish M",
        "time": "7 months ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKdJSrx_FjkheAp04pWbL11e3-XEXuDpPoEMsPHXFsK7CXIH2E=w65-h65-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/xJjadwVnPPtDsqk69",
        "reply": "Dear Anish \n Congratulations on your USA Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Hiba Mohammed",
        "time": "7 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Had a very good experience with global visas. I got my UK visitor visa within 3 weeks time. They assisted me through all the documentations. They did the legal formalities like affidavits etc. I had a stressfree time as opposed to the time I had applied by myself.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocL4gShIT4DKb2hFVy4N4AmXzWAMVucVTLvghKdZl0zK17c3lQ=w65-h65-p-rp-mo-ba3-br100",
        "link": "https://share.google/ZI0cq77r8Wskp8zN8",
        "reply": "Dear Hiba \n Congratulations on your UK Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Padmini P",
        "time": "7 months ago",
        "source": "Google",
        "rating": 5,
        "text": "I had a positive experience with Global Visa International. After I contacted them, they took the time to assess my case thoroughly and I found their team to be professional, knowledgeable and incredibly helpful. Their team handled my case with patience and professionalism, providing clear guidance and support throughout the entire process. They guided me through every step of the application process, carefully reviewing my documents and offering insightful advice to improve my chances. Thanks to their efforts, I was able to successfully obtain my Visa. I highly recommend their services, especially if you have had past visa challenges!!",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLt-raj8vZmzhSvVZtnszhmijSWpYpyityoqE2m5R2xEcSqTg=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/53HWLd8dVMLdU4ElG",
        "reply": "Dear Padmini \n Congratulations on your UK Visitor Visa Grant!! We so happy we could reverse your refusal and get you the UK visitor, Thank you for giving us the opportunity to serve you.  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!! \n Regards \n Team GVI"
    },
    {
        "name": "greeshma s",
        "time": "10 months ago",
        "source": "Google",
        "rating": 5,
        "text": "We had a fantastic experience with GlobalVisa Internationals! They were incredibly polite, professional, and well organised throughout the process of handling our Schengen visa application. Their meticulous attention to detail ensured that all our paperwork was completed flawlessly, making the entire process smooth and stress-free and we received our visa in a couple of days. Mrs.Anusha & Ms. Soni were always approachable and ready to assist with any queries we had. I highly recommend their services to anyone looking for a hassle-free visa application experience. Thank you for your excellent support!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjViNG2IES_dRPe89vRdQXCki8PIcp0Nfo6Y1A3i58-o3DQGwXLx=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/yLcgyRBUDQRgvjurf",
        "reply": "Dear Greeshma \n Congratulations on your Spain Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Ankitha Tenkila27",
        "time": "11 months ago",
        "source": "Google",
        "rating": 5,
        "text": "From documentation of all paper works needed to verifying every minute details the team did an excellent job and I got my visa to Germany without no issues.They were always available for my queries, ready to answer every small question of mine. Thanks to Soni from their team who was with us from beginning sometimes extending her work hours for us and also Anusha for leading everything.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLciAvjTVQ5spnq7FA5AVrA4dbVNQy51ZDsQO-wupjNZiOEWg=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/O6L92zt8ca6BQ2Y2r",
        "reply": "Dear Ankitha \n Congratulations on your Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!! \n Regards \n Team GVI"
    },
    {
        "name": "Saheb Chakraborty",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Super fast service at an affordable cost",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjUcyaR2NAYBSM2d_uNr44n2csCCfPmfuvCdFC3mxewMhvJDcO4=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/pvXBPUBkMSUzdq7A5",
        "reply": "Dear Saheb Chakraborty \n Congratulations on your Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Pranit Ramchandani",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Got my Australian sports visa within 10 days as promised. Professional and efficient visa agency.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjWKba0WLUneScvUL_IX18yNsAoIS2wAdo_FxPtYUAwEbCnx_3JYpg=w65-h65-p-rp-mo-ba2-br100",
        "link": "https://share.google/gbCjMNzaagTEPT8sS",
        "reply": "Dear Pranit \n Congratulations on your Australian Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  RegardsTeam GVI"
    },
    {
        "name": "Sarmistha Diponed",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVHlLA-sw_jI8vWlVrSnUtElFhFvdTW0mDKdvS1yEThPNx_Wq8jdQ=w65-h65-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/uEAR9F3eAev6zE8PA",
        "reply": "Dear Sarmistha \n Congratulations on your USA Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Vinoj KV",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "I got my US visa through Global Visa Internationals. They helped me out with everything in a thoroughly professional way right from the very beginning, understanding my requirements and doing what it needed to clear the visa interview. I appreciate their transperancy and patience. I am glad I chose the right agency.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLXw8F60aQAuAlHnF5l-gzyvVoK0zgl8zpwTI-6CUXdsU_d=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/20UYRJ1tWLJH6GA3D",
        "reply": "Dear Vinod \n Congratulations on your USA Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Soumya Sen",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "The team here helped me attain my UK tourist visa and meticulously helped me arrange all documents in order for the process. They are super knowledgeable and helpful. Would strongly recommend everyone to avail their services.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjUszWtLzKDA9T7a5Z02aJIJsSsgEmbGPqsXXlknzlfYPIFtbJQ=w65-h65-p-rp-mo-ba3-br100",
        "link": "https://share.google/jNDq9eWQNP3zDXxwk",
        "reply": "Dear Soumya Sen \n Congratulations on your UK Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Lal Krishna",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "I had an excellent experience with Global Visa Internationals while processing my Swedish business visa. My visa application was submitted on time, with no delays. The consultants displayed exceptional professionalism and expertise. I am pleased to note that my visa was approved and received within a week. I extend my sincere thanks to the entire team for their invaluable support and guidance.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVTTaNQDACwcE7peEa1kKN7dxhJzM0zI4mJnYyq9Cp9mof55J6QCA=w65-h65-p-rp-mo-ba3-br100",
        "link": "https://share.google/n6ia2dZUDPVQOzASO",
        "reply": "Dear Lal Krishna \n Congratulations on your Sweeden Business Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Chirag Patni",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Great experience. It was quick and smooth process. Knowledgeable and are aware of the way things work. Appreciate it. We had applied for the US visa. Thanks",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocIGP56lpGLnhzuA682A7urMn5a3RrZOHnsWYBTAPlB6rVRq73k=w65-h65-p-rp-mo-ba4-br100",
        "link": "https://share.google/Ects6mbakBK1qQQEp",
        "reply": "Dear Chirag \n Congratulations on your USA Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards  \n\n  Team GVI"
    },
    {
        "name": "Gaurav D",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocI_V6rIup9ADj8K9u1xXQl_dJE1cdnrj5cL3rc1Nhu_MS_WtA=w65-h65-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/4rghMd6Gakc1SYXt7",
        "reply": "Dear Gaurav \n Congratulations on your UK PLAB 2 Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Nikil B K",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjV1qWO_6l9tZ7TYpQxA_D-cn5IC4RrTFYw0YzgFzEjhyvSOmKEF=w65-h65-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/aJDya8xtGR6hDfrT9",
        "reply": "Thank you for your review, Nikil! We're glad to have had the opportunity to assist you. If you ever need our services again, don' t hesitate to reach out. We're here to help! 😊"
    },
    {
        "name": "Shridhar patil",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "I approached Global Visa Internationals for my wife's tourist visa to Austria. Excellent work was done by Anusha and her team at GVI. From writing the cover letter to collecting and verifying all the documents as per the checklist, this team did a great job. My wife was granted an Austrian tourist visa within a week of submitting the documents. We are extremely happy and grateful for this. I highly recommend Global Visa Internationals to anyone who is looking for help with their visa process.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjU9EwqppbkDKcGv58i_BepyyT5kOJP7HC75c1Fx-TJo41h4Q3c=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/pygKfX2BS7tXQoa9z",
        "reply": "Dear Shridhar Patil \n Congratulations on your Austria Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "swathi nagraj",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Global Visa international Centre provided excellent, efficient service with friendly staff and clear communication. The facilities were clean and comfortable, making the visa process smooth and stress-free.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjUcch6-NbiEU2wTRLDDv9Z9H9-pZILIJhMmTWmUt-PYcDqRl4I=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/iPe3q1EYKMjVYRrPo",
        "reply": "Dear Swathi \n Congratulations on your UK Settlement Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "swathi nagraj",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "You were very helpful in providing all the required details. Thank you.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLPK6RujEEAENXucPOvB-7I9ZQ-nbCAUIXknypzxuiuy_0gZSo=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/m5XAupDUB2zFHqE45",
        "reply": "Dear Altaf Sheikh \n Congratulations on your UK Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.  \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.  \n\n  Bon Voyage!!  \n\n  Regards \n Team GVI"
    },
    {
        "name": "Rohit Gowda",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "One of the best services and highly recommended. Every visa is possible here.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjWX--3uyW4zjwb6chaZo_lsqQpfTcJtRiAHPqeqUTeE9yxAzkU=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/dRwXIx6TvA4mABgav",
        "reply": "Thank you so much for your fantastic feedback, Rohit! We're thrilled to hear that you had such a great experience with us. Your recommendation means the world to our team. We' re always here to make sure your visa process is as smooth as possible! 🌍✈️"
    },
    {
        "name": "Nikhil d Gowda",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "One of the best in the business,I came with global visa on Google service by the team was exceptional from the initial stage till end good staff,great consultancy beat in the business.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjX8mqqTkgJDKRoYAB65HyJz8X89sLIHfUEuu81WIBHeZd4cgK68pw=w65-h65-p-rp-mo-ba2-br100",
        "link": "https://share.google/A9vRzh1oZdxTpO9dC",
        "reply": "Thank you so much for your wonderful review, Nikhil! We' re thrilled to hear that you had such a positive experience with our team from start to finish. Your kind words mean a lot to us, and we' re proud to have earned your trust. We' re always here to assist with any future visa needs! 😊🌍"
    },
    {
        "name": "aakarsh gv",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "I am elated to share my heartfelt appreciation for the extraordinary services during the process of obtaining my Australia visa. Their exceptional guidance and unwavering support have played an integral role in fulfilling my dreams.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjX6OqOgkvFfUAIqUcFlpPu0gHiVx5Qicp0j5JHZgaaDt6ir3lPp=w65-h65-p-rp-mo-ba2-br100",
        "link": "https://share.google/Cvy5Iubw0Dx5roOR5",
        "reply": "Thank you so much for your kind words, Aakarsh! We're overjoyed to hear that our team could play a part in making your dream of obtaining an Australia visa come true. Your trust and appreciation mean a lot to us. If you ever need assistance in the future, we' re always here to help! 🌟🇦🇺"
    },
    {
        "name": "Sanjay G",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjX-ZiGv6nThRuke5mxEy2LcA9qWHlY_olw49Viv0zzw89m9dF2zEw=w32-h32-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/7ByfQEquoRWf58w66",
        "reply": "Thank you for your review, Sanjay! We're glad to have had the opportunity to assist you. If you ever need our services again, feel free to reach out. We're always here to help! 😊 …"
    },
    {
        "name": "Bindu Yadav",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocJHdnur4sMEDvUWHoBpfTMmo5oTaWoqPG1uXMGY-ZZG0hFtzzk=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/zaYXHBGygZyy6NRt5",
        "reply": "Thank you for your 5-star review, Bindu! We're grateful for your feedback and always here if you need assistance in the future."
    },
    {
        "name": "Bipin Bopanna CT",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjU_BSnh-1rdE5WbptZCQ-HppqYF_q9tnq4HEOHzAOEr9x5mWJ95Pg=w36-h36-p-rp-mo-ba3-br100",
        "link": "https://maps.app.goo.gl/7wckKrdDTiQTpTQt6",
        "reply": "Thank you for the 5-star rating, Bipin! We truly appreciate your feedback. If you need any assistance in the future, don' t hesitate to reach out!"
    },
    {
        "name": "Âbhî Âbhíšhêķ",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXTWzYNI-GZHHfyDBQkaQM_luw7XKyzoi01LtwspLM4EQ3A9Y8VHw=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/G3UtQRAHyRCZMnyq5",
        "reply": "Thank you for the 5-star rating, Abhishek. We appreciate your feedback. Feel free to reach out if you need any assistance in the future!"
    },
    {
        "name": "Arjun Nair",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Great Hassel free service and support. Very professional! \n Must visit.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVi6n-ETUrORBnNrKcbrLnL5PqTwnQKK1cUcwOZu2u_lFNtgXIi_g=w36-h36-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/WGBaKR9LoKxZ5haN7",
        "reply": "Thank you so much for your kind words, Arjun! We're delighted to hear that you had a hassle-free experience with us. Your recommendation means a lot, and we're always here to assist with any future visa needs. 😊 …"
    },
    {
        "name": "prajwal gowda",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "I came through one of my friend they are very professional and educative. The service is on point and I would recommend this consultation for your visa requirements.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXvTVAtcIj9WtsLAfZEj_Pd3Az4zgeE04DmAfbGjQfqwX2sWeoC=w36-h36-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/1vSg3B8edv6EaFh69",
        "reply": "Thank you for your wonderful feedback, Prajwal! We're glad to hear that our team could provide you with professional and informative service. Your recommendation means a lot to us, and we' re always here to assist with your future visa needs! 😊 …"
    },
    {
        "name": "Rohit Gowda",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Once of the best in town, my friend was struggling to get a Visa to UK, these guys made it for him at affordable cost.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLCisXJLpt4ZtdfMag7lr_fvnm-v-PrRyf5aTMt6C6llwWGjw=w36-h36-p-rp-mo-ba3-br100",
        "link": "https://maps.app.goo.gl/jh5PVaD5QCyLtxpi6",
        "reply": "Thank you so much for your kind words, Rohit! We' re thrilled to hear that we could help your friend secure a UK visa and provide an affordable solution. Your recommendation means a lot to us, and we're always here to assist with any future visa needs. 😊 …"
    },
    {
        "name": "Steeph Rock",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "It was really an good experience \n They made it very easy in each n every step",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVE-RQfvjtGgG4pUFOnX728s4U2lSMso6F13t9dqOgCLikWUyWV=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/3e6Hw4vQvVHk5ssv6",
        "reply": "Thank you so much for your positive feedback, Steeph! We're thrilled to hear that we made the process easy for you. It was a pleasure assisting you, and we' re always here if you need any further help in the future! 😊 …"
    },
    {
        "name": "dhanush bhat",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Amazing visa service provided.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLn7AcsTxx6KIVgBWLGyX3LD7xJMzShRaLwL67v72pj9vLvLg=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/NtgnmHxQBPDFuMa56",
        "reply": "Thank you for your wonderful review, Dhanush! We' re glad to hear you had a great experience with our visa services. If you ever need assistance again, feel free to reach out!"
    },
    {
        "name": "ragini palangappa",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "I wanted to take a moment to express my sincere gratitude for the exceptional service provided by your team throughout the visa processing for my recent travel plans. \n From the initial stages of document validation to ensuring all paperwork was up to date, your consultancy demonstrated professionalism and efficiency at every step of the process. I am particularly grateful for the outstanding support provided by Vidhya. Her dedication, patience, and willingness to address all my queries and doubts made the entire experience seamless and stress-free. \n My heartfelt appreciation to Vidhya and the entire team for their commendable efforts. Thanks to your assistance, I can now embark on my journey with confidence and peace of mind.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocJhynQEDaDuzF6sm02K2164pbh-_-_wjZ9U7TBZ_H0NUn1yTg=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/Ws6gWo8X78bumdY67",
        "reply": "Dear Ragini \n Congratulations on your UK Visitor Visa Grant!!  \n\n  We' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience. \n\n  We are so happy that we could stand on your expectations and reverse your previous visa rejection.\n Bon Voyage!! \n\n  Regards\nTeam GVI"
    },
    {
        "name": "Harish S",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "I recently had the pleasure of utilizing the services of Global Visa Internationals for my US B1/B2 visa application process for my mother and me, and I must say, I am thoroughly impressed. From start to finish, their team especially Bharathi, led by Anusha, provided exceptional support and guidance.\n\nAnusha, the visa consultant assigned to my case, was incredibly knowledgeable and attentive. She patiently walked me through the entire process, ensuring that I understood each step and requirement for my visa interview. Her professionalism and expertise instilled confidence in me, making what could have been a daunting experience much more manageable.\n\n One aspect that stood out to me was the level of personalized attention I received. Despite the company likely handling multiple applicants simultaneously, Anusha made me feel like a priority, promptly responding to any questions or concerns I had along the way. This dedication to customer service is commendable and greatly appreciated.\n\n Additionally, Global Visa Internationals streamlined process for scheduling appointments on priority and preparing for the interview was invaluable. They provided comprehensive guidance on gathering necessary documents, preparing for potential interview questions,mock interviews, and ensuring all paperwork was in order. Thanks to their thorough assistance, I felt fully prepared and confident\n\n Overall, my experience with Global Visa International was exceptional. Their professionalism, attention to detail, and commitment to customer satisfaction truly set them apart. I wholeheartedly recommend their services to anyone in need of visa assistance. Anusha and the team at Global Visa International have exceeded my expectations, and I am grateful for their support throughout this process.\n\nThanks teams for the guidance and support.😁",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjUcWNj3Vq_-qRvxNDmuTohN6V89Vun0DAkWJfYmeysEy4caBe4=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/7xbBF6vzpdYqM8b47",
        "reply": "Dear Harish\nCongratulations on your USA Visa Grant!!\n\nWe' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam GVI"
    },
    {
        "name": "Lakshminarayana U",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "We got our Japanese visitor visa through Global Visa Internationals for four us in the family. Our experience has been good and the team is fantastic. Paperwork, document submission and getting the visa all done in 2 weeks.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVcj2cvOGMUbb8FslCXmTgNwzotiUo0By0qKyh4-kdTO1OhiUvr=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/hkeRSDa4XQiZvBtJA",
        "reply": "Dear Lakshminarayana\nCongratulations on your Japan Visa Grant!!\n\nWe' re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can' t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam GVI"
    },
    {
        "name": "Chetan Vora",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Global Visa center is a saviour. Myself and my wife were planning to travel Schengen countries but had lots of doubts and questions around documentation. Anusha and her team addressed all our queries with extreme patience and utmost clarity. We were so relaxed after they took over the VISA application process for us. Kudos to Anusha for setting up such an efficient process and team. Also for guiding us throughtout. We got a multi entry visa and the entire process went seamless. We will highly recommend Global Visa. Cheers !!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjUlGMqv8HQE7LOjCh6bv4XVuyv3OtAYEK6t1Hkwywj4XfW4RTg=w36-h36-p-rp-mo-ba3-br100",
        "link": "https://maps.app.goo.gl/HAPMGNRE9esQyGUn8",
        "reply": "Dear Chethan\nCongratulations on your Schengen Visa Grant!!\n\nWe’re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\nnRegards\nTeam GV"
    },
    {
        "name": "Vinnarasi Dominique",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "I contacted them for my U.S visa and I had the best experience",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjWr8G-ZfnXCgaOhc1UzB5G1climrnd-ZBsTD8CErwb3qj0qEdmIrg=w36-h36-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/cwR5CoYo5HfKTVCW6",
        "reply": "Dear Vinnarasi\nCongratulations on your USA & UK Visa Grant!!\n\nWe’re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam GVI"
    },
    {
        "name": "Nuthan Kumar",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjWr8G-ZfnXCgaOhc1UzB5G1climrnd-ZBsTD8CErwb3qj0qEdmIrg=w36-h36-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/L1wiJxoijK22Bogx8",
        "reply": "Dear Nuthan\nCongratulations on your USA and Schengen Visitor Visa Grant!!\n\nWe’re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations and reverse your previous visa rejection.\n\nBon Voyage!!\n\nRegards\n Team GVI"
    },
    {
        "name": "Santosh",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Dear all,\n I am sharing my experience with global visa internationals. Right from start after payment of fees I was given a list of documents. Very diligently I arranged all of them and handed over to vidya. We had a few sittings before we could finally submit our application.  Best thing is they double ensure for all right documents. Then me and my daughter who is appearing for PLAB2 exam in UK gave our visa interview on 04 Mar and by 12 Mar2024 the stamped passport with UK visa was delivered to me. Though I had not opted for FastTrack still it was received just in a week. So, it means our documents were in order. All thanks to Anusha and her team. Keep up the good work and best part  it's a strong women's team. Please utilise their services if you want your documents submission error free.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocJI5Cc1tXGMp-0wt7hvAdnR7iCEfejzF9w3IWJczAZib7umyg=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/aDU3kbyQxXkLw5xE7",
        "reply": "Dear Santhosh\nCongratulations on your UK Visa Grant!!\n\nWe’re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam GVI"
    },
    {
        "name": "VINAY KUMAR",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Nice team, they made my job so easy by nicely working on my paper work. Thank you!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVJytxGzhG7AvLGS5Ks9cV7BvMpWy_VQcVhBRThM3VDukVKnkm5=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/s6XcSnD8J9tYRD2J9",
        "reply": "Dear Vinay\nCongratulations on your UK PLAB 2 Visa Grant!!\n\nWe’re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam GVI"
    },
    {
        "name": "Pallavi NK",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Thank you for your assistance in obtaining my UK dependant Visa and 2 UK Tourists visa for my parents. I appreciate your professionalism and efficiency throughout the process.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLQnq5JvxM2gVSVRD-IWWCb4u1X9ATyLaljyKIPdj-S7ufsE_8=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/EbJLTHrTrDQyMQTN7",
        "reply": "Dear Pallavi\nCongratulations on your UK dependent visa and Visitor Visa Grant for your in-laws !!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Vis"
    },
    {
        "name": "Aman Kumar",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Got my visa, experience was very good Anusha Mam helped alot and also soni mam",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjW1gGuCwYlMJfcOifNu5h2bU2DqKPuVreErlkD1tPeftxpZ27eN=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/xvRD3uS4ZQKDWbMt8",
        "reply": "Dear Aman\nCongratulations on your UK Visitor Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "Anand Ram.S",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "First and foremost, I would like to commend Global visa consultants and Anusha for their in-depth knowledge of the UK visa requirements and regulations. Their guidance throughout the application process was invaluable, ensuring that all necessary documents were submitted accurately and on time. This level of expertise instilled confidence in us and made the process significantly less daunting.\n\nFurthermore, the personalised approach taken by Soni deserves special recognition. She took the time to understand our specific situation and provided tailored advice accordingly. This individualized attention made us feel valued as clients and helped streamline the application process.\n\nIn terms of areas for improvement, I have a few suggestions that I believe could further enhance the overall experience for future clients:\n\nEnhanced Communication: While your consultants were generally responsive, improving communication channels such as offering a dedicated client portal or mobile app for updates and queries could further streamline communication and provide real-time status updates.\n\nTransparency in Fees: Providing a detailed breakdown of fees and any potential additional costs upfront would help clients better understand the financial aspect of the visa application process from the outset.\n\nExpanded Resources: Offering additional resources such as informational webinars or FAQ guides tailored specifically to UK Dependent Visa applicants could further empower clients and alleviate any uncertainties they may have.\n\n Despite these minor suggestions, please know that our overall experience with your consultancy was extremely positive, and we are grateful for your assistance every step of the way.\n\nI want to extend my best wishes for continued success to your team. Your dedication to excellence sets a benchmark in the industry, and I have no doubt that you will continue to thrive in providing exceptional service to your clients.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXEctHKrFxUxHIqxGNyyiK3gWLfFJ6XnilRUBX5WsLX1mOM58Dn=w72-h72-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/6T69oBVhxwD2mu1Q7",
        "reply": "Dear Anand\nCongratulations on your UK Skilled worker - Partner Visa Grant!!\n\nAnd your suggestions are highly appreciated, will upgrade our services shortly\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "Darshan Yandigeri",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Came across Global Visa Internationals through Google search and I must say they have lived up to the expectations of the Google reviews/rating. I was very concerned regarding my UK dependent visa as I had history of 2 UK tourist visa rejections in last 1 year, but Anusha was still very confident on securing me the visa. They have great team especially Soni mam, who was handling my application process, was just a call & text away from clearing any doubts regarding documents collection. I finally received my UK dependent visa last week within just 10 days from date of biometrics.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjWSfmBS6u_gkXvoZMAaGw72SBrM_pDQFy9xuNWlN7CDxg-i-YXH=w72-h72-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/KVEPP7L9y6S8kDet5",
        "reply": "Dear Darshan\nCongratulations on your UK Skilled worker dependent Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "Shibu Ghosh",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Hey there! Just letting you know that the people I connected with here were super honest and supportive. And guess what? Even after I paid the full fee, they were still just as helpful and friendly, offering me guidance whenever I needed it. I'm really glad I chose to work with them and would definitely recommend them to others. Thanks a lot!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjX1Ky6NwTjJ6CjXkyE8Mh2d1sgBd57ZLaxtfIqfVF0GS2TLrw7r=w72-h72-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/KVEPP7L9y6S8kDet5",
        "reply": "Dear Shibu\nCongratulations on your France Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "sobiya farook",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKCvDbZwrTgwp7HuUMrxpijg0_5wPu9CZz00ZCwRtIot0wmfg=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/dtqSG6FFdgwUnsur9",
        "reply": "Dear Sobiya\nCongratulations on your UK - PLAB2 Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "naveen d",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Very much helpfull Vidhya  and Anusha mam was very supportive in getting me Visa process well trained and experience and highly qualified consultant  I had a great experience overall.Thanks a lot.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocJ8LVKQw06zPfNkNurnsuvh8CDTGMZbmv4DXORrDy_eNbqMBg=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/SJqQKk7b8RTnhJ3x9",
        "reply": "Dear Naveen\nCongratulations on your USA Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "Sneha Panikkaveettil",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocIh35MSA8pW-c6fymGHC68SZrPWtJRtshxsO5dtb5xf1puyaQ=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/veWujAnLXRXVb1VY7",
        "reply": "Dear Sneha\nCongratulations on your UK - Skilled Worker Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "Likith Reddy",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjWrStMjw_9rBh8b6sx_36mOeorJaVnnZUosIqZgvtLMN9dFhOpk=w72-h72-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/oLycQaBQVubJqcs78",
        "reply": "Dear Likith Reddy\nCongratulations on your USA Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "Pavan Maruthi",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "Global Visa Internationals is the right place to find solutions to all your immigration and visa process. Their team works so well I got my things done with in a week. Their team put a lot of efforts and dedication to my profile. I received an amazing service from them must recommend immigration and visa consultant in Bangalore.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjUOWijHMOtDBsunERjzxlVzzgq3skWE2VDZvjh8AeP9TJUQrwvWtg=w72-h72-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/qRHMJVKkWQHAcFUX9",
        "reply": "Dear Pavan\nCongratulations on your France Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "Kaushik Sundar",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "I had applied for  US visa (B1/B2) through Global Visa Internationals and got my visa appointment within a week's time.  I also got my visa approved today ( Jan 2024)\n\nOverall, it was a great experience working with global visa international team. Anusha, Bharati and team helped me though every step of the process and answered every query I had.\n\nI will highly recommend Global Visa Internationals for anyone who is looking to apply for visas.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocIYAldoV3UksCQA97cASgasaD8HndYkkctQc9fvMo7aD2Mb-A=w72-h72-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/jt4TBzx5c6duuiwQ6",
        "reply": "Dear Koushik\nCongratulations on your USA Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "sinchana gaovnkar",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "I got my visa arrived as in the expected date.Thanks Global visa for making it happen in the smooth way.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXMJlr0xdajSdE2B1zFKKjuQRVz2DsJaDGUjmbzaxvNpHu6VPO4=w72-h72-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/n2dZTiLyB4w2dtQt9",
        "reply": "Dear Sinchana\nCongratulations on your USA Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "sacchin hassan",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocK8WDzOFU2ZeaaBLyB6Cm2fnLvhxT2r0m9ZOmWOPFfDik6p9w=w36-h36-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/xHHTKMJhTyUv6oKZ6",
        "reply": "Dear Sachin\nCongratulations on your USA Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "Suni Marpan",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "GVI Team you rock! 🏅\nI got my Visa approved in just 8 business days 🙌🏻. Special thanks to Soni, Bharti for processing my UK visa from end to end. They ensure that every documents provided were to be made for a valid reason and this shows the kind of expertise they're holding. Their hard work and dedication pays off 🙌🏻. You guys deserve an accolades 👏 👏👏. Anusha the mind behind gave me the support and spirit that, 99% I would get my Visa and I am impressed with the service. I would definitely recommend their best service to my friends and family. Thanks again GVI Team.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVvsv_eiJWvTU6NlpJMcxsedsp3VI0AuYraz7J9MgNz74EvJEz4WA=w72-h72-p-rp-mo-br100",
        "link": "https://maps.app.goo.gl/XN31VWTJoydE52xT6",
        "reply": "Dear Sunitha\nCongratulations on your UK Visa Grant!!\n\nWe’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    },
    {
        "name": "Shruthi Dhevi",
        "time": "1 year  ago",
        "source": "Google",
        "rating": 5,
        "text": "They dealt with the process with ease. They know what they do and they do it well. Thanks to dear Bharathi who was very calm and helpful all the time and thanks to Soni who was of a great help",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKGoUrYLkoEpcfMx3cLSBOJYHfF7Cc_iZ0xAVKBN0sWA-S3eQ=w36-h36-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/bDMCEnEah1oB7iBD9",
        "reply": "Dear Shruthi Devi \n Congratulations on your Schengen Visa Grant!!  \n\n  We’re really grateful and appreciate you taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations\n\nBon Voyage!!\n\nRegards\nTeam Global Visa Internationals"
    }
]