[
    {
        "name": "Snehal Prakash",
        "time": "1 year ago",
        "source": "Google",
        "rating": 5,
        "text": "A big thanks to Anusha and her team for helping me for acquiring my Schengen Visa.! They really helped me in collecting and preparing all the required documents for the visa application. The complete team was very professional and did an exceptional job!  I got my Visa in just 3 Days! Kudos to Anusha and team Global Visa International.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXGeZmRzZDOw452Ssj6N5L3xCnZZq3T_YMahdShdtR3rdLfJ2be_Q=w32-h32-p-rp-mo-ba2-br100",
        "link": "https://maps.app.goo.gl/mL2DJEAWFAiazQgN6",
        "reply": "Dear Snehal, Congratulations on your Schengen Visa Grant! We are so happy that we could stand on your expectations. Thank you so much for your wonderful review. Please stay in touch and always happy to serve you. Bon Voyage!! Regards, Team Global Visa Internationals"
    },
    {
        "name": "Rachita M",
        "time": "13 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Dear Anusha and Team,  I want to express my deepest gratitude for the incredible support and guidance you provided throughout our immigration journey to Australia.    This process came with its fair share of challenges — especially during the uncertainty of the COVID pandemic. With border closures, extended time lines, and the need to revisit paperwork multiple time's, it often felt overwhelming. But your unwavering support, patience, and professionalism helped us navigate every step with confidence and hope.    Through all the ups and downs, your team remained a constant source of reassurance. You didn’t just help with paperwork and procedures — you stood by us, encouraged us, and ultimately made our dream come true.    Thank you for being such a vital part of this life-changing journey. We will always be grateful.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKyuUt0BhIMQZ5xnQFq4TewIAP8uYkZ1G40O40odDFLYgMnowI=w65-h65-p-rp-mo-ba3-br100",
        "link": "https://share.google/1nKBIcjDyv2uz5G2J"
    },
    {
        "name": "Shruthi AE",
        "time": "4 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Thank you global visa ,your services are awesome,I obtained visa hassle free because of your services.I would recommend everyone Global visa any time.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLD0bGpUVfhkIZJMmazJCVCGeYwUrd0WvK4ug7jIXWZQNmVDw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/l6rtyeBnYAkKufHRg"
    },
    {
        "name": "Uren shah",
        "time": "2 months ago",
        "source": "Google",
        "rating": 5,
        "text": "After facing two refusals for my parents’ UK visitor visa, we were extremely disheartened and unsure of what to do next. That’s when we approached Global Visa International, and it made all the difference.\n\nA special thanks to Vidhya who handled our case with great care, patience, and professionalism. She understood our situation, guided us step by step, and helped us submit a much stronger application.\n\nThanks to her support and the team’s expertise, my parents have finally received their visa! We’re truly grateful and highly recommend Global Visa International to anyone needing visa assistance.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocI-1Lm_rD0wDNAG9M_ZxRYaaMyVjV8p8FdAFTJ2a1c8zUq4uQ=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/wEctJtfYgGZreGWvC"
    },
    {
        "name": "Arvind Radhakrishnan",
        "time": "1 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Excellent service by the team. Very professional. Thank you",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjW9BJAxrqNlz4X2tKAmQCh5l3HgASMMCv5aUKIZ-FbV_N1p80Y9=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/VzxTtkENFCLjxFoKE"
    },
    {
        "name": "Hitesh Shah",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Had a great experience working with the Global Visa team. Anusha as a leader is considerate and very helpful.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKZn-mcb_ZfrdQ21leQZZSIbAuYGA4RsvUJXyZw_moELMv88A=w65-h65-p-rp-mo-ba4-br1000",
        "link": "https://share.google/TtxLEw7CuMMPxyoJt"
    },
    {
        "name": "adarsh shah",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjXJzKtC_mmIkIabWLfzSpHcaIU6GKSedGi2mRdLZtdzdgQcOdM=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/TtxLEw7CuMMPxyoJt",
        "reply": "Thank you so much, Adarsh, for your kind words and 5-star review! 🙏\n\nWe are truly delighted to have helped you successfully secure your USA Student Visa. 🎓✈️ Your trust in Global Visa Internationals means a lot to us.\n\n Our team strives to make the visa process smooth and stress-free for every student. Wishing you all the best in your academic journey ahead! 🇺🇸📚\n\n If you need any further assistance — travel, documentation, or post-arrival support — we’re always here for you.\n\n Thanks again for choosing us as your visa consultants in Bangalore!"
    },
    {
        "name": "N K Reshma",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "I had an amazing experience with Anusha Prashanth. I had only a week before my travel date, and other agencies told me it was not possible to get a Schengen visa in such a short time. But Anusha was confident and assured me it could be done — and she delivered! I received my Spain visa in just 3 days, exactly as promised, and she also helped me with a priority UK visa.\n\n Special thanks to Vidya for ensuring all my documentation was perfect and the process was smooth from start to finish. Truly professional, reliable, and efficient. Highly recommend them for any visa needs!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjW4icfFk44_yDtXgCEoWgRMfTJStVm976TKyqwukmvAaNNh__wr=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/rFgnXk7i1jAzfDUrC"
    },
    {
        "name": "Bhavya Ammu",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Dear Global Visa Team,\n\nI would like to express my sincere thanks for your exceptional support in helping me secure my Australia visa within just a week. Your efficiency, professionalism, and prompt coordination made the process smooth and stress-free.\n\nA special note of appreciation to Anusha and Vidhya for their in-depth knowledge, transparency, and constant communication throughout the entire process. Your dedication truly stands out.\n\nThis isn’t the first time I’ve had such a great experience with your team — last year, you also assisted me with my Europe visa, and I was equally impressed.\n\nI look forward to continuing our relationship for all my future travel needs. Thank you once again for being such a reliable and supportive partner.\n\nRegards\n\nBhavya Praveen",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLXSHaRYswyFsk5hATQ6WWjlbiD3l92j_-53Dz071TO3tYWOw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/q5HPAkGIzgp3SKFIv"
    },
    {
        "name": "Mahesh Hiremath",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Okay super",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjV8lDR8J5RLnCmSDgaOh3LvTZXajbnQl1BY-GJezIAm4VM3scdCZg=w65-h65-p-rp-mo-ba3-br100",
        "link": "https://share.google/xBQaEwtAKnxcyYoko"
    },
    {
        "name": "Naina Teertha",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "I would like to thank Anusha and team for getting me the new zealand visitor visa. I got the visa within a month after submitting the application.Anusha is so friendly to talk. I insist can go for visa application at this place based on my personal experience. Thanks Anu for processing my application 💕💕.\n\nI thank the team again\n\nI know anu from long time\n\nThis is my second time visa which I applied at her place\n\nAnd I m really happy that I received shengan visa within two weeks\n\nThe team is very professional and they handle with care\n\nIf you are looking for a germany and other 29 countries travel\n\nThen this is the place to visit to apply the visa\n\nThey will take care of it end to end\n\nThanks Vidya and Anu for the support.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKwesy-FWOg-w6dBza0Q7kDZILLtsIf218o-mIfyykK9nBP1A=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/z7MgZd23Dl2V4VCKg",
        "reply": "Thank you, Naina, for your kind. Once again, congratulations on the grant of your Schengen Visa (Five-Year Multiple Entry).\n\nWe wish you all the very best.\n\nTeam Global Visa Internationals"
    },
    {
        "name": "Rachita M",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Dear Anusha and Team,\n\nI want to express my deepest gratitude for the incredible support and guidance you provided throughout our immigration journey to Australia.\n\nThis process came with its fair share of challenges — especially during the uncertainty of the COVID pandemic. With border closures, extended timelines, and the need to revisit paperwork multiple times, it often felt overwhelming. But your unwavering support, patience, and professionalism helped us navigate every step with confidence and hope.\n\nThrough all the ups and downs, your team remained a constant source of reassurance. You didn’t just help with paperwork and procedures — you stood by us, encouraged us, and ultimately made our dream come true.\n\nThank you for being such a vital part of this life-changing journey. We will always be grateful.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocKyuUt0BhIMQZ5xnQFq4TewIAP8uYkZ1G40O40odDFLYgMnowI=w65-h65-p-rp-mo-ba3-br100",
        "link": "https://share.google/UlKIAeWXuqtyeIPXA",
        "reply": ""
    },
    {
        "name": "Karthik Prabhakaran",
        "time": "3 months ago",
        "source": "Google",
        "rating": 5,
        "text": "I got in touch with Global Visa to assist with my in-laws' tourist visa application for Switzerland, and I couldn't be happier with their service! From the very beginning, the team was extremely professional, knowledgeable, and supportive throughout the entire visa process. They patiently guided us through all the documentation requirements, ensuring everything was accurate and complete, which made the entire application process smooth and stress-free.\n\nWhat impressed me even more was their continued support even after the visa was approved. Due to some unforeseen changes in our travel plans, we needed to modify the travel insurance dates. The team handled this promptly and efficiently, ensuring everything was updated without any hassle.\n\nTheir dedication, attention to detail, and excellent customer service truly made a difference. I highly recommend Global Visa to anyone looking for reliable and professional assistance for visa processing and travel-related support. Thank you for making this experience so easy and positive for our family!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjX3Rx99XP3zTzF3FT4OmxmHyst333exyoqXNwDX0CIDKDjuq0aa=w65-h65-p-rp-mo-ba2-br100",
        "link": "https://share.google/KgKgA7rr4Bm5FExSL",
        "reply": ""
    },
    {
        "name": "Shruthi AE",
        "time": "4 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Thank you global visa ,your services are awesome,I obtained visa hassle free because of your services.I would recommend everyone Global visa anytime.",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLD0bGpUVfhkIZJMmazJCVCGeYwUrd0WvK4ug7jIXWZQNmVDw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/sXnAxwZ5USR6rsxEJ",
        "reply": ""
    },
    {
        "name": "Priya Srinivasa",
        "time": "4 months ago",
        "source": "Google",
        "rating": 5,
        "text": "",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocJ-NCEHESpGyvq1P4wlKh3XYrnZKD4UsoLJlpQ8XwHfmSjTtQ=w65-h65-p-rp-mo-br100",
        "link": "",
        "reply": ""
    },
    {
        "name": "Santhosh Francis",
        "time": "6 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Big thanks to Global Visa Internationals Agency for turning a stressful visa process into a breeze! Their team was on point with every detail, and thanks to them, my Schengen visa came through without a hitch. Totally recommend them if you want peace of mind during the visa application and documentation process!",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLZcvHtcMRyHbh7R-y7KXfAR5xSPtaJ-KFoaA2ce6XunaBqYg=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/EBVtuE5MXjpI4qCJJ",
        "reply": "Thank you so much for your kind words and for trusting Global Visa Internationals with your Schengen visa process! 🌍✈️ We're thrilled to hear that we could make things smooth and stress-free for you. Your recommendation means a lot to our team. Wishing you amazing travels ahead – we're always here if you need any visa assistance in the future! 🙌😊"
    },
    {
        "name": "vimal khumar",
        "time": "6 months ago",
        "source": "Google",
        "rating": 5,
        "text": "I was referred to Global Visa Internationals in Bangalore by a friend who had a successful visa experience with them after a couple of initial rejections. From the very beginning, the team was approachable and clearly explained all the requirements—right from financial documentation to the necessary paperwork.\n\nVidya, who handled my case, was extremely patient, always listened carefully, and sought second opinions from Anusha whenever there was a doubt. This gave me a lot of confidence throughout the process, especially since my family had faced a couple of visa rejections before.\n\nVidya managed the entire process smoothly and took care of almost all the documentation, only asking me for a few mandatory documents. Thanks to the professionalism and support from the team, my family finally got their visa approved.\n\nA big thanks to Global Visa Internationals—and a special mention to Vidya for her dedication and support!",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjVsy-YMLUsxVOBIai316QBQWYDaYNsyXN8KikwN4O_4qoLprZLw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/kJdtXn50aWYk9eosG",
        "reply": "Thank you so much for taking the time to share your experience! We're truly delighted to hear that Vidya and Anusha were able to support you and your family through the visa process with care and professionalism. Helping clients overcome past rejections and succeed brings us immense satisfaction. We'll be sure to pass along your kind words to Vidya – she’ll be thrilled! 😊 Wishing you and your family all the best on your travels, and we’re always here if you need us again! ✨🌏"
    },
    {
        "name": "muhammed shazul",
        "time": "7 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Please do consider GLOBAL VISA INTERNATIONALS when thinking of getting a visa to US OR UK or anywhere around the world. Had a wonderfull experice with the team. Kudos to the GLOBAL VISA TEAM.",
        "avatar": "https://lh3.googleusercontent.com/a-/ALV-UjUOjZUAkWEUpRkormcEHdrxorQO288IteNKGLHxJFlFocwzzDeK=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/5MHMA2T8e0vstY3gt",
        "reply": "Dear Shazul\n\nCongratulations on your USA Visitor Visa Grant!!\n\nWe’re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations and reverse your previous visa rejection.\n\nBon Voyage!!\n\nRegards\n\nTeam GVI"
    },
    {
        "name": "indu sethi",
        "time": "7 months ago",
        "source": "Google",
        "rating": 5,
        "text": "Very good service. Thank you..",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocLXzkRFWxg6o-iBv0BN4xeRdeFanAlX7e4YYfInhAoVvyL9bw=w65-h65-p-rp-mo-br100",
        "link": "https://share.google/exRjlZzWaB2HCKL8o",
        "reply": "Dear Indu\n\nCongratulations on your Visa Grant!!\n\nWe’re really grateful and appreciate you for taking the time to share your rating with us!! We sincerely appreciate your business and your valuable feedback. Your satisfaction is what drives us, and we can’t wait to welcome you back for another outstanding experience.\n\nWe are so happy that we could stand on your expectations and reverse your previous visa rejection.\n\nBon Voyage!!\n\nRegards\n\nTeam GVI"
    }
]